insert into person (full_name, birthday, email)
values
    ('Иванов Иван Иванович', '1990-05-27', 'ivan@gmail.com'),
    ('Васильев Николай Васильевич', '2001-07-07', 'nikolai@gmail.com'),
    ('Сидоров Алексей Сергеевич', '2004-11-28', 'alex@gmail.com'),
    ('Кузнецова Елена Николаевна', '1988-05-01', 'elena@gmail.com'),
    ('Петрова Мария Петровна', '1964-09-08', 'maria@gmail.com');

insert into book (title, author, published, person_id, taken_at)
values
    ('Война и мир', 'Лев Толстой', 1869, 1, '2024-10-10'),
    ('Анна Каренина', 'Лев Толстой', 1877, 1, '2024-09-30'),
    ('Pride and Prejudice', 'Jane Austen', 1813, null, null),
    ('1984', 'George Orwell', 1949, 2, '2024-10-01'),
    ('Мастер и Маргарита', 'Михаил Булгаков', 1936, null, null),
    ('Великий Гэтсби', 'Ф. Скотт Фицджеральд', 1925, 5, '2024-10-14'),
    ('Улисс', 'Джеймс Джойс', 1922, null, null),
    ('Маленькая принцесса', 'Франсуаз Саган', 1954, null, null),
    ('Бесконечная история', 'Даниэль Киз', 1956, 2, '2024-10-16');
