insert into person (full_name, birth_year, email)
values
    ('Иванов Иван Иванович', 1990, 'ivan@gmail.com'),
    ('Васильев Николай Васильевич', 2001, 'nikolai@gmail.com'),
    ('Сидоров Алексей Сергеевич', 2004, 'alex@gmail.com'),
    ('Кузнецова Елена Николаевна', 1978, 'elena@gmail.com'),
    ('Петрова Мария Петровна', 1962, 'maria@gmail.com');

insert into book (title, author, published_year, person_id)
values
    ('Война и мир', 'Лев Толстой', 1869, 1),
    ('Анна Каренина', 'Лев Толстой', 1877, 1),
    ('Pride and Prejudice', 'Jane Austen', 1813, null),
    ('1984', 'George Orwell', 1949, 2),
    ('Мастер и Маргарита', 'Михаил Булгаков', 1936, null),
    ('Великий Гэтсби', 'Ф. Скотт Фицджеральд', 1925, 5),
    ('Улисс', 'Джеймс Джойс', 1922, null),
    ('Маленькая принцесса', 'Франсуаз Саган', 1954, null),
    ('Бесконечная история', 'Даниэль Киз', 1956, 2);
